Repository: Dzunisani007/KasiKashApp
Catalog: translations/ss/LC_MESSAGES/messages.po
Languages: ss

source: admin_settings
ss: Tinhlelo ta Mlawuli

source: switch_to_user_view
ss: Shintsha Ekuboneni Komsebenti

source: admin_settings_subtitle
ss: Hlela tinhlelo tesistimu nemvume

source: user_permissions
ss: Imvume Yabasebenti

source: financial_controls
ss: Kulawula Imali

source: notifications
ss: Tindzaba

source: meetings_events
ss: Tihlangano & Tintfo

source: data_security
ss: Kuvikela Data

source: languages
ss: Tilwimi

source: select_admin_language
ss: Khetsa Lulwimi Lwemlawuli

source: english
ss: SiNgisi

source: role_management
ss: Kulawula Indima

source: assign_roles_help
ss: Nika indima kulawula imvume

source: admin_full_access
ss: Mlawuli - Kufinyelela Lokuphelele

source: loan_approval_permissions
ss: Imvume Yekugunyazwa Kwemalimboleko

source: choose_loan_approval_roles
ss: Khetsa indima lengagunyaza imalimboleko

source: adminstreasurerssecretaries
ss: Balamlawuli, Baphethe Imali, Bangcweti

source: audit_logs
ss: Ama-Log Ekuhlola

source: theme
ss: Indikimba:

source: view_audit_logs_help
ss: Bheka umsebenti wesistimu nekushintja

source: action
ss: Sento

source: performed_by
ss: Kwenziwe Ngu

source: target
ss: Ithagethi

source: amount
ss: Inani

source: date
ss: Lilanga

source: cancel
ss: Khansela

source: save_settings
ss: Londoloza Tinhlelo

source: contribution_rules
ss: Imitsetfo Yekunikela

source: set_contribution_rules_help
ss: Seta imitsetfo yekunikela kwemalunga

source: monthly_amount
ss: Inani Lenyanga:

source: late_penalty
ss: Inhlawulo Yekubili:

source: grace_period
ss: Sikhatsi Sothando:

source: days
ss: Emalanga

source: loan_settings
ss: Tinhlelo Temalimboleko

source: configure_loan_settings_help
ss: Hlela emapharamitha emalimboleko nemitsetfo

source: max_loan_percent
ss: Ipesenti Leliphezulu Lemalimboleko:

source: interest_rate
ss: Ilinga Lemali:

source: repayment_period
ss: Sikhatsi Sekubuyisela:

source: 6 months
ss: Tinyanga Leti-6

source: withdrawal_approvals
ss: Kuvumela Kukhipha

source: require_dual_approval_help
ss: Kudinga kuvumela lokubili kukhipha

source: enable_dual_approval_for_withdrawals
ss: Vumela Kuvumela Lokubili Kukhipha

source: recurring_meetings
ss: Tihlangano Letiphindaphindako

source: schedule_meetings_help
ss: Hlela tihlangano letivamile

source: meeting_frequency
ss: Kuvama Kwetihlangano:

source: monthly
ss: Ngenyanga

source: day_of_week
ss: Lilanga Lesonto:

source: monday
ss: UMsombuluko

source: time
ss: Sikhatsi:

source: send_automatic_reminders
ss: Thumela Ema-Log Ekuzenzakalela

source: attendance_tracking
ss: Kulandela Kuba Khona

source: record_attendance_help
ss: Bhalisa kuba khona kwemalunga etihlanganweni

source: enable_attendance_tracking
ss: Vumela Kulandela Kuba Khona

source: absence_penalty
ss: Inhlawulo Yekungabi Khona:

source: 5after
ss: 5% Ngemuva

source: missed_meetings
ss: Tihlangano Letikhonakele

source: meeting
ss: Tihlangano

source: present
ss: Kuba Khona

source: absent
ss: Akekho

source: Welcome, Admin ðŸ‘‹
ss: Sawubona, Admin ðŸ‘‹

source: Stokvel Admin Dashboard
ss: Dashboard ya Botsamaisi ya Stokvel

source: Total Members
ss: Malunga lonkhe

source: from last month
ss: kusukela inyanga ledlule

source: Active Loans
ss: Timali letibolekako letisebentako

source: pending approval
ss: elindzele kuvunywa

source: Total Contributions
ss: Timali letifakako tonkhe

source: KYC Pending
ss: KYC Ilindzele

source: urgent reviews
ss: kubuyeketwa lokubalulekile

source: Quick Actions
ss: Tentfo Letikhawuleza

source: Manage Users
ss: Lawula Basebenti

source: Loan Approvals
ss: Kuvunywa Kwetimali Letibolekako

source: Virtual Rewards
ss: Imivuzo Yobungcweti

source: Generate Reports
ss: Dala Imibiko

source: Financial Chart
ss: Ishadi Letimali

source: User Growth Chart
ss: Ishadi Lokukhula Kwabasebenti

source: User Management
ss: Kulawula Basebenti

source: View, add, edit, or suspend user accounts with advanced filtering and bulk operations.
ss: Bona, engeza, hlela, noma misa ema-akhawunti abasebenti ngokuhlunga lokuthuthukile nokusebenta lokubanzi.

source: Bulk Operations
ss: Tentfo Tebanzi

source: Review and approve loan applications with detailed financial analysis and risk assessment.
ss: Buyekeza futsi uvumele ticelo tetimali letibolekako ngokuhlaziya kwetimali lokuningiliziwe nekuhlola bungoti.

source: Review Applications
ss: Buyekeza Ticelo

source: Approval History
ss: Umlando Wokuvunywa

source: Generate comprehensive financial reports with advanced analytics and export capabilities.
ss: Dala imibiko yetimali lephelele ngokuhlaziya lokuthuthukile nemandla ekukhipha.

source: Export Data
ss: Khipha Idatha

source: Could not load users or stokvels.
ss: Ayikwazanga kulayisha basebenti noma stokvels.

source: manage_users
ss: lawula_basebenti

source: Here you can manage all users.
ss: Lapha ungakwazi kulawula bonkhe basebenti.

source: search username or email
ss: sesha libito lomsebenti noma i-imeyili

source: search
ss: sesha

source: add_user
ss: engeza_umsebenti

source: email
ss: i-imeyili

source: role
ss: indima

source: created_at
ss: kwenziwe_nga

source: actions
ss: tentfo

source: No users found.
ss: Akukho basebenti labatholakale.

source: Here you can approve or reject loan applications.
ss: Lapha ungakwazi ukuvumela noma ukwenqaba ticelo tetimali letibolekako.

source: Filter by status:
ss: Hlunga ngesimo:

source: Pending
ss: Ilindzele

source: Username
ss: Libito Lomsebenti

source: Amount
ss: Inani

source: Status
ss: Simo

source: Transaction Date
ss: Lilanga Lokwenziwa

source: Comment
ss: Ukuphawula

source: Actions
ss: Tentfo

source: No loans found for this status.
ss: Akukho mali ebolekako etholakale kulesi simo.

source: Filter
ss: Hlunga

source: Events
ss: Imicimbi

source: Here you can manage events.
ss: Lapha ungaphatha imicimbi.

source: Select a Stokvel
ss: Khetha i-Stokvel

source: Name
ss: Libito

source: Target Date
ss: Lilanga Lelihlosiwe

source: Description
ss: Incazelo

source: Send notification to all members of this stokvel
ss: Thumela isaziso kubo bonke emalunga ale stokvel

source: Create Event
ss: Dala Umcimbi

source: No events found.
ss: Ayikho imicimbi etholakele.

source: Membership Plans
ss: Amacebo Ebulungu

source: Here you can manage membership plans.
ss: Lapha ungaphatha amacebo ebulungu.

source: Search by plan name
ss: Sesha ngegama lecebo

source: Add Plan
ss: Engeza Icebo

source: Monthly Contribution
ss: Umnikelo Wenyanga

source: Target Amount
ss: Inani Lelihlosiwe

source: Total Pool
ss: Isigcawu Esiphelele

source: No membership plans found.
ss: Ayikho amacebo ebulungu atholakele.

source: send_notification
ss: thumela_isaziso

source: Notification Type
ss: Luhlobo Lwesaziso

source: Send to Stokvel Members
ss: Thumela Emalungeni E-Stokvel

source: urgent
ss: okusheshayo

source: message
ss: umyalezo

source: Enter your notification message...
ss: Faka umyalezo wakho wesaziso...

source: type
ss: luhlobo

source: Admin Notification
ss: Isaziso Lokuphatha

source: Send
ss: Thumela

source: Admin Notifications
ss: Izaziso Zokuphatha

source: Here you can send notifications to users.
ss: Lapha ungathumela izaziso kubasebenzisi.

source: Create Notification
ss: Dala Isaziso

source: User ID
ss: ID Yomsebenzisi

source: No notifications found.
ss: Ayikho izaziso ezitholakele.

source: kyc_approvals
ss: ukuvuma_kyc

source: Here you can approve or reject KYC submissions.
ss: Lapha ungavuma noma wenqabe ukuthunyelwa kwe-KYC.

source: id_document
ss: idokumenti_yekuzazisa

source: proof_of_address
ss: bufakazi_bekheli

source: ID Document Status
ss: Simo Sedokumenti Sekuzazisa

source: Proof of Address Status
ss: Simo Sobufakazi Bekheli

source: view
ss: bona

source: approve
ss: vuma

source: reject
ss: nqaba

source: Virtual Rewards Management
ss: Ukuphatha Amarewardi Angempela

source: Manage reward points, view user balances, and distribute rewards to users.
ss: Phatha amaphuzu amarewardi, bheka amabalansi abasebenzisi, futhi sasazela amarewardi kubasebenzisi.

source: Overview
ss: Ukuqapha

source: Analytics
ss: Ukuhlaziya

source: Rules
ss: Imithetho

source: Users with Reward Cards
ss: Abasebenzisi Abanekhadi Lamarewardi

source: Total Reward Balance
ss: Ibhalansi Yonke Yamarewardi

source: Total Transactions
ss: Zonke Izinkokhelo

source: Individual Reward Distribution
ss: Ukusasazela Kwemarewardi Ngamunye

source: User Email
ss: I-imeyili Yomsebenzisi

source: Reward Type
ss: Uhlobo Lwemarewardi

source: Points
ss: Amaphuzu

source: Reward description
ss: Incazelo yemarewardi

source: Distribute Reward
ss: Sasazela Imarewardi

source: Bulk Reward Distribution
ss: Ukusasazela Kwemarewardi Ngobuningi

source: User Filter
ss: Isihlungi Somsebenzisi

source: All Users
ss: Bonke Abasebenzisi

source: Amount per User
ss: Inani Ngomsebenzisi Ngamunye

source: Bulk reward description
ss: Incazelo yemarewardi ngobuningi

source: Bulk Distribute
ss: Sasazela Ngobuningi

source: Export Transactions (CSV)
ss: Khipha Izinkokhelo (CSV)

source: Export Transactions (Excel)
ss: Khipha Izinkokhelo (Excel)

source: Export Balances (CSV)
ss: Khipha Amabalansi (CSV)

source: Export Balances (Excel)
ss: Khipha Amabalansi (Excel)

source: User Reward Balances
ss: Amabalansi Amarewardi Abasebenzisi

source: User
ss: Umsebenzisi

source: Card Number
ss: Inombolo Yekhadi

source: Balance
ss: Ibhalansi

source: Recent Reward Transactions
ss: Izinkokhelo Zamarewardi Zamuva

source: Date
ss: Usuku

source: Type
ss: Uhlobo

source: Reward Analytics
ss: Ukuhlaziya Amarewardi

source: Comprehensive analytics and insights for your reward system.
ss: Ukuhlaziya okuphelele kanye nokuqonda uhlelo lwakho lwemarewardi.

source: Months of Data
ss: Izinyanga Zedatha

source: Top Earners Tracked
ss: Abathola Kakhulu Abalandelwa

source: Reward Types
ss: Izinhlobo Zamarewardi

source: Monthly Reward Distribution
ss: Ukusasazela Kwemarewardi Kwenyanga

source: Top Reward Earners
ss: Abathola Kakhulu Amarewardi

source: Rank
ss: Isikhundla

source: Total Earned
ss: Inani Elitholakele

source: Reward Type Distribution
ss: Ukusasazela Kwemarewardi Ngohlobo

source: Reward Rules Configuration
ss: Ukuhlela Imithetho Yamarewardi

source: Configure automatic reward triggers and multipliers for your reward system.
ss: Hlela izinto ezivusa amarewardi okuzenzakalelayo kanye nokubanekisa uhlelo lwakho lwemarewardi.

source: Automatic Reward Rules
ss: Imithetho Yamarewardi Ezenzakalelayo

source: Contribution Multiplier
ss: Isibambisi Sokunikelela

source: How many reward points users earn per R1 contributed to stokvels.
ss: Mangaki amaphuzu amarewardi abasebenzisi abathola ngayinye R1 enikelwe kuma-stokvel.

source: Welcome Bonus
ss: Ibhonasi Yokwamukela

source: Reward points given to new users when they join the platform.
ss: Amaphuzu amarewardi anikezwa abasebenzisi abasha lapho bejoyina ipulatifomu.

source: Referral Bonus
ss: Ibhonasi Yokudlulisa

source: Reward points given when a user successfully refers another user.
ss: Amaphuzu amarewardi anikezwa lapho umsebenzisi edlulisa omunye umsebenzisi ngempumelelo.

source: Monthly Bonus
ss: Ibhonasi Yenyanga

source: Monthly reward points given to active users who made contributions.
ss: Amaphuzu amarewardi anyanga anikezwa abasebenzisi abasebenza abanikele.

source: Event Attendance Bonus
ss: Ibhonasi Yokuba Khona Emicimbini

source: Reward points given for attending stokvel events and meetings.
ss: Amaphuzu amarewardi anikezwa ngokuba khona emicimbini yama-stokvel kanye nemihlangano.

source: Loan Payment Bonus
ss: Ibhonasi Yokukhokha Imali

source: Reward points given for on-time loan payments.
ss: Amaphuzu amarewardi anikezwa ngokukhokha imali ngesikhathi.

source: Save Reward Rules
ss: Gcina Imithetho Yamarewardi

source: How Reward Rules Work
ss: Imisebenzi Yemithetho Yamarewardi

source: Contribution Multiplier: Users earn this many points per R1 contributed. Set to 1 for 1:1 ratio.
ss: Isibambisi Sokunikelela: Abasebenzisi bathola amaphuzu amaningi ngayinye R1 enikelwe. Beka ku-1 ukuze ube nokulingana kwe-1:1.

source: Welcome Bonus: Automatically given to new users upon registration.
ss: Ibhonasi Yokwamukela: Inikezwa okuzenzakalelayo kubasebenzisi abasha lapho bebhalisa.

source: Referral Bonus: Given when a user successfully refers another user to the platform.
ss: Ibhonasi Yokudlulisa: Inikezwa lapho umsebenzisi edlulisa omunye umsebenzisi epulatifomu ngempumelelo.

source: Monthly Bonus: Given monthly to users who made contributions in the previous month.
ss: Ibhonasi Yenyanga: Inikezwa nyanga zonke kubasebenzisi abanikele enyangeni edlule.

source: Event Attendance: Given for attending stokvel events and meetings.
ss: Ukuba Khona Emicimbini: Inikezwa ngokuba khona emicimbini yama-stokvel kanye nemihlangano.

source: Loan Payment: Given for on-time loan payments and good financial behavior.
ss: Ukukhokha Imali: Inikezwa ngokukhokha imali ngesikhathi kanye nokuziphatha okuhle kwezezimali.

source: data_export
ss: Kutfumela Idatha

source: download_data_help
ss: Landa idatha yakho njengefayela le-CSV

source: two_factor_auth
ss: Kucinisekisa Lokubili (2FA)

source: enable_2fa_help
ss: Vumela kucinisekisa lokubili kuvikele i-akhawunti yakho

source: require_2fa_for_admins
ss: Dinga 2FA kubaphatsi

source: data_retention
ss: Kugcinwa Kwedatha

source: configure_data_retention_help
ss: Hlela sikhatsi sekugcina umlando wetintfo tekutitsengiselana

source: keep_transaction_history_for:
ss: Gcina umlando wetintfo tekutitsengiselana sikhatsi lesingakanani:
