Repository: Dzunisani007/KasiKashApp
Catalog: translations/nso/LC_MESSAGES/messages.po
Languages: nso

source: admin_settings
nso: Dikgetho tša Molaodi

source: switch_to_user_view
nso: Fetola go Ponelo ya Mošomiši

source: admin_settings_subtitle
nso: Bea dikgetho tša sisteme le dumelelo

source: user_permissions
nso: Dumelelo tša Bašomiši

source: financial_controls
nso: Taolo ya Tšhelete

source: notifications
nso: Ditsebišo

source: meetings_events
nso: Dikopano & Ditiragalo

source: data_security
nso: Tšhireletšo ya Data

source: languages
nso: Dipolelo

source: select_admin_language
nso: Kgetha Polelo ya Molaodi

source: english
nso: Seisimane

source: role_management
nso: Taolo ya Sebopego

source: assign_roles_help
nso: Nea dibopego tša taolo ya dumelelo

source: admin_full_access
nso: Molaodi - Kgetho ya Motheo

source: loan_approval_permissions
nso: Dumelelo tša Dumelelo tša Maletso

source: choose_loan_approval_roles
nso: Kgetha dibopego tšeo di kgonago go dumelela maletso

source: adminstreasurerssecretaries
nso: Balaodi, Baphethe Tšhelete, Bangwadi

source: audit_logs
nso: Di-Log tša Tekolo

source: theme
nso: Sehlogo:

source: view_audit_logs_help
nso: Bona mošomo wa sisteme le phetogo

source: action
nso: Tiro

source: performed_by
nso: E Dirwa ke

source: target
nso: Mokgatho

source: amount
nso: Tekanyo

source: date
nso: Letsatsi

source: cancel
nso: Khansela

source: save_settings
nso: Boloka Dikgetho

source: contribution_rules
nso: Melawana ya Ditlhabollo

source: set_contribution_rules_help
nso: Bea melawana ya ditlhabollo tša maloko

source: monthly_amount
nso: Tekanyo ya Kgwedi:

source: late_penalty
nso: Kotlo ya Go Bili:

source: grace_period
nso: Nako ya Kgetho:

source: days
nso: Matšatši

source: loan_settings
nso: Dikgetho tša Maletso

source: configure_loan_settings_help
nso: Bea dikgetho tša maletso le melawana

source: max_loan_percent
nso: Pesente ya Maletso a Motheo:

source: interest_rate
nso: Tekanyo ya Tšhelete:

source: repayment_period
nso: Nako ya Go Bušetša:

source: 6 months
nso: Dikgwedi tše 6

source: withdrawal_approvals
nso: Dumelelo tša Go Tšhoša

source: require_dual_approval_help
nso: Nyaka dumelelo tše pedi tša go tšhoša

source: enable_dual_approval_for_withdrawals
nso: Dumelela Dumelelo tše Pedi tša Go Tšhoša

source: recurring_meetings
nso: Dikopano tša Go Boela

source: schedule_meetings_help
nso: Bea dikopano tša mehla

source: meeting_frequency
nso: Go Tswalana ga Dikopano:

source: monthly
nso: Ka kgwedi

source: day_of_week
nso: Letsatsi la Beke:

source: monday
nso: Mošupologo

source: time
nso: Nako:

source: send_automatic_reminders
nso: Roma Ditsebišo tša Boitsebišo

source: attendance_tracking
nso: Go Landa Go Ba Gona

source: record_attendance_help
nso: Ngwala go ba gona ga maloko dikopanong

source: enable_attendance_tracking
nso: Dumelela Go Landa Go Ba Gona

source: absence_penalty
nso: Kotlo ya Go Se Ba Gona:

source: 5after
nso: 5% Morago

source: missed_meetings
nso: Dikopano tše di Sego

source: meeting
nso: Kopano

source: present
nso: Gona

source: absent
nso: Ga a Gona

source: Welcome, Admin 👋
nso: Re a go amogela, Admin 👋

source: Stokvel Admin Dashboard
nso: Dashboard ya Botsamaisi ya Stokvel

source: Total Members
nso: Maloko ka moka

source: from last month
nso: go tloga kgweding e fetilego

source: Active Loans
nso: Dikadimo tše di phelago

source: pending approval
nso: e emetše tumelelo

source: Total Contributions
nso: Dineelo ka moka

source: KYC Pending
nso: KYC e emetše

source: urgent reviews
nso: ditlhahlobo tša potlako

source: Quick Actions
nso: Ditiro tša Potlako

source: Manage Users
nso: Laola Basebedisi

source: Loan Approvals
nso: Tumelelo ya Dikadimo

source: Virtual Rewards
nso: Meputso ya Inthanete

source: Generate Reports
nso: Dira Dipego

source: Financial Chart
nso: Chate ya Ditšhelete

source: User Growth Chart
nso: Chate ya Kgolo ya Basebedisi

source: User Management
nso: Botsamaisi bja Basebedisi

source: View, add, edit, or suspend user accounts with advanced filtering and bulk operations.
nso: Bona, tsenya, fetola goba emiša diakhaonto tša basebedisi ka go sefa go tseneletšego le ditiro tše dintši.

source: Bulk Operations
nso: Ditiro tše dintši

source: Review and approve loan applications with detailed financial analysis and risk assessment.
nso: Hlahloba le go amogela dikopo tša dikadimo ka tshekatsheko ya ditšhelete e tseneletšego le kotsi.

source: Review Applications
nso: Hlahloba Dikopo

source: Approval History
nso: Histori ya Tumelelo

source: Generate comprehensive financial reports with advanced analytics and export capabilities.
nso: Dira dipego tše di feletšego tša ditšhelete ka tshekatsheko e tseneletšego le bokgoni bja go romela ka ntle.

source: Export Data
nso: Romela Data

source: Could not load users or stokvels.
nso: Ga e kgone go laetša basebedisi goba stokvels.

source: manage_users
nso: laola_basebedisi

source: Here you can manage all users.
nso: Mo o ka laola basebedisi ka moka.

source: search username or email
nso: batla leina la modiri goba imeile

source: search
nso: batla

source: add_user
nso: tsenya_modiri

source: email
nso: imeile

source: role
nso: maikarabelo

source: created_at
nso: tlhamilwe_ka

source: actions
nso: ditiro

source: No users found.
nso: Ga go na basebedisi ba ba hweditšwego.

source: Here you can approve or reject loan applications.
nso: Mo o ka amogela goba gana dikopo tša dikadimo.

source: Filter by status:
nso: Sefa ka seemo:

source: Pending
nso: E emetše

source: Username
nso: Leina la Modiri

source: Amount
nso: Madi

source: Status
nso: Seemo

source: Transaction Date
nso: Letšatši la Phetoho

source: Comment
nso: Tshwao

source: Actions
nso: Ditshwao

source: No loans found for this status.
nso: Ga go na dikadimo tše di hweditšwego mo seemong se.

source: Filter
nso: Hlase

source: Events
nso: Ditiro

source: Here you can manage events.
nso: Mona o ka laola ditiro.

source: Select a Stokvel
nso: Kgetha Stokvel

source: Name
nso: Leina

source: Target Date
nso: Letsatsi la Morero

source: Description
nso: Tlhaloso

source: Send notification to all members of this stokvel
nso: Romela tsebiso go maloko ka moka a stokvel ye

source: Create Event
nso: Hlama Tiro

source: No events found.
nso: Ga go na ditiro tse di hweditsego.

source: Membership Plans
nso: Maano a Botshwaro

source: Here you can manage membership plans.
nso: Mona o ka laola maano a botshwaro.

source: Search by plan name
nso: Nyaka ka leina la morero

source: Add Plan
nso: Oketsa Morero

source: Monthly Contribution
nso: Tshepediso ya Kgwedi

source: Target Amount
nso: Tekanyo ya Morero

source: Total Pool
nso: Mokgatlho wa Motho

source: No membership plans found.
nso: Ga go na maano a botshwaro a a hweditsego.

source: send_notification
nso: romela_tebiso

source: Notification Type
nso: Mofuta wa Tebiso

source: Send to Stokvel Members
nso: Romela go Maloko a Stokvel

source: urgent
nso: ka pela

source: message
nso: molaetša

source: Enter your notification message...
nso: Tsenya molaetša wa gago wa tebiso...

source: type
nso: mofuta

source: Admin Notification
nso: Tebiso ya Taolo

source: Send
nso: Romela

source: Admin Notifications
nso: Ditsebiso tsa Taolo

source: Here you can send notifications to users.
nso: Mona o ka romela ditsebiso go basebedisi.

source: Create Notification
nso: Hlama Tebiso

source: User ID
nso: ID ya Mosebedisi

source: No notifications found.
nso: Ga go na ditsebiso tse di hweditsego.

source: kyc_approvals
nso: dumelela_kyc

source: Here you can approve or reject KYC submissions.
nso: Mona o ka dumelela goba gana ditlhaeletšo tša KYC.

source: id_document
nso: tokomane_ya_identity

source: proof_of_address
nso: ponagalo_ya_adrese

source: ID Document Status
nso: Maemo a Tokomane ya Identity

source: Proof of Address Status
nso: Maemo a Ponagalo ya Adrese

source: view
nso: bona

source: approve
nso: dumelela

source: reject
nso: gana

source: Virtual Rewards Management
nso: Taolo ya Dikgetho tša Virtual

source: Manage reward points, view user balances, and distribute rewards to users.
nso: Laola dikgetho tša dikgetho, bona dipalo tša basebedisi, le abela dikgetho go basebedisi.

source: Overview
nso: Kakaretšo

source: Analytics
nso: Dinyakišišo

source: Rules
nso: Melawana

source: Users with Reward Cards
nso: Basebedisi ba Dikarata tša Dikgetho

source: Total Reward Balance
nso: Kakaretšo ya Dipalo tša Dikgetho

source: Total Transactions
nso: Kakaretšo ya Dikgwebo

source: Individual Reward Distribution
nso: Kabo ya Dikgetho ya Mongwe le Mongwe

source: User Email
nso: Imeile ya Mosebedisi

source: Reward Type
nso: Mohuta wa Dikgetho

source: Points
nso: Dikgetho

source: Reward description
nso: Tlhaloso ya dikgetho

source: Distribute Reward
nso: Aba Dikgetho

source: Bulk Reward Distribution
nso: Kabo ya Dikgetho ka Kgolo

source: User Filter
nso: Sehlasehi sa Mosebedisi

source: All Users
nso: Basebedisi Ka moka

source: Amount per User
nso: Tekanyo ka Mosebedisi

source: Bulk reward description
nso: Tlhaloso ya dikgetho ka kgolo

source: Bulk Distribute
nso: Aba ka Kgolo

source: Export Transactions (CSV)
nso: Tšweletša Dikgwebo (CSV)

source: Export Transactions (Excel)
nso: Tšweletša Dikgwebo (Excel)

source: Export Balances (CSV)
nso: Tšweletša Dipalo (CSV)

source: Export Balances (Excel)
nso: Tšweletša Dipalo (Excel)

source: User Reward Balances
nso: Dipalo tša Dikgetho tša Basebedisi

source: User
nso: Mosebedisi

source: Card Number
nso: Nomoro ya Karete

source: Balance
nso: Palo

source: Recent Reward Transactions
nso: Dikgwebo tša Dikgetho tša Muva

source: Date
nso: Letsatsi

source: Type
nso: Mohuta

source: Reward Analytics
nso: Dinyakišišo tša Dikgetho

source: Comprehensive analytics and insights for your reward system.
nso: Dinyakišišo tše kgolo le kutlwisiso bakeng sa sisteme ya gago ya dikgetho.

source: Months of Data
nso: Dikgwedi tša Data

source: Top Earners Tracked
nso: Ba Hwetšago Kgalo ba Latelwa

source: Reward Types
nso: Mehuta ya Dikgetho

source: Monthly Reward Distribution
nso: Kabo ya Dikgetho ya Kgwedi

source: Top Reward Earners
nso: Ba Hwetšago Dikgetho Kgalo

source: Rank
nso: Boemo

source: Total Earned
nso: Kakaretšo ya Hweditšwego

source: Reward Type Distribution
nso: Kabo ya Mohuta wa Dikgetho

source: Reward Rules Configuration
nso: Peakanyo ya Melawana ya Dikgetho

source: Configure automatic reward triggers and multipliers for your reward system.
nso: Peaka dikgetho tša go tšwela ka boyona le dikgetho bakeng sa sisteme ya gago ya dikgetho.

source: Automatic Reward Rules
nso: Melawana ya Dikgetho ya go Tšwela ka Boyona

source: Contribution Multiplier
nso: Kgetho ya Tshepedišo

source: How many reward points users earn per R1 contributed to stokvels.
nso: Dikgetho tše kae tša dikgetho tšeo basebedisi ba di hwetšago ka R1 e nngwe le e nngwe yeo ba e tshepedišago go ma-stokvel.

source: Welcome Bonus
nso: Kgetho ya Kamogelo

source: Reward points given to new users when they join the platform.
nso: Dikgetho tša dikgetho tšeo di abelwago basebedisi ba mpsha ge ba kena platformeng.

source: Referral Bonus
nso: Kgetho ya Kgokagano

source: Reward points given when a user successfully refers another user.
nso: Dikgetho tša dikgetho tšeo di abelwago ge mosebedisi a kgokaganya mosebedisi yo mongwe ka katlego.

source: Monthly Bonus
nso: Kgetho ya Kgwedi

source: Monthly reward points given to active users who made contributions.
nso: Dikgetho tša dikgetho tša kgwedi tšeo di abelwago basebedisi ba šomago bao ba dirilego tshepedišo.

source: Event Attendance Bonus
nso: Kgetho ya Tseno ya Ditiro

source: Reward points given for attending stokvel events and meetings.
nso: Dikgetho tša dikgetho tšeo di abelwago ka go tsenela ditiro tša ma-stokvel le dikopano.

source: Loan Payment Bonus
nso: Kgetho ya Tefo ya Madi

source: Reward points given for on-time loan payments.
nso: Dikgetho tša dikgetho tšeo di abelwago ka tefo ya madi ka nako.

source: Save Reward Rules
nso: Boloka Melawana ya Dikgetho

source: How Reward Rules Work
nso: Melawana ya Dikgetho e Šoma bjang

source: Contribution Multiplier: Users earn this many points per R1 contributed. Set to 1 for 1:1 ratio.
nso: Kgetho ya Tshepedišo: Basebedisi ba hwetša dikgetho tše ka tše ka R1 e nngwe le e nngwe yeo ba e tshepedišago. Beakanya go 1 bakeng sa tekanyo ya 1:1.

source: Welcome Bonus: Automatically given to new users upon registration.
nso: Kgetho ya Kamogelo: E abelwa ka boyona basebedisi ba mpsha ge ba ngwadiša.

source: Referral Bonus: Given when a user successfully refers another user to the platform.
nso: Kgetho ya Kgokagano: E abelwa ge mosebedisi a kgokaganya mosebedisi yo mongwe platformeng ka katlego.

source: Monthly Bonus: Given monthly to users who made contributions in the previous month.
nso: Kgetho ya Kgwedi: E abelwa kgwedi ka kgwedi go basebedisi bao ba dirilego tshepedišo kgweding ye fetilego.

source: Event Attendance: Given for attending stokvel events and meetings.
nso: Tseno ya Ditiro: E abelwa ka go tsenela ditiro tša ma-stokvel le dikopano.

source: Loan Payment: Given for on-time loan payments and good financial behavior.
nso: Tefo ya Madi: E abelwa ka tefo ya madi ka nako le boitshwaro bjo botse bja tša tšhelete.

source: data_export
nso: Go Romela Data

source: download_data_help
nso: Laolla data ya gago bjalo ka faele ya CSV

source: two_factor_auth
nso: Netefatšo ya Dintlha tše Pedi (2FA)

source: enable_2fa_help
nso: Dumela netefatšo ya dintlha tše pedi go šireletša akhaonto ya gago

source: require_2fa_for_admins
nso: Nyaka 2FA go balaodi

source: data_retention
nso: Go Boloka Data

source: configure_data_retention_help
nso: Beakanya nako ya go boloka histori ya ditransekšene

source: keep_transaction_history_for:
nso: Boloka histori ya ditransekšene bakeng sa:
