Repository: Dzunisani007/KasiKashApp
Catalog: translations/ve/LC_MESSAGES/messages.po
Languages: ve

source: Add New Payment Method
ve: Uengeza Ndila Ntswa ya Mbofho

source: Payment Type
ve: Mupo wa Mbofho

source: Dashboard
ve: Bodo ya Vhurereli

source: Manage Users
ve: Tshimbidza Vhashumisi

source: Loan Approvals
ve: Mafhungo a Mabindu

source: Events
ve: Mishumo

source: Membership Plans
ve: Mveledziso dza Vhushumeli

source: Notifications
ve: Zwiwiso

source: KYC Approvals
ve: Mafhungo a KYC

source: Virtual Rewards
ve: Mivhuyo ya Marang-rang

source: Logout
ve: Buda
