Repository: Dzunisani007/KasiKashApp
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: xh, zu

source: Add New Payment Method
xh: Yongeza Indlela Entsha Yokuhlawula
zu: Engeza Indlela Yokukhokha Entsha

source: Payment Type
xh: Uhlobo Lokuhlawula
zu: Uhlobo Lokukhokha

source: Dashboard
xh: Ikhasi Lokubhekisa
zu: Ikhasi Lokubheka

source: Manage Users
xh: Lawula Abasebenzisi
zu: Phatha Abasebenzisi

source: Loan Approvals
xh: Ukwamkelwa Kwemali-Mboleko
zu: Ukuvunywa Kwezikweletu

source: Events
xh: Iziganeko
zu: Imicimbi

source: Membership Plans
xh: Izicwangciso Zobulungu
zu: Izinhlelo Zobulungu

source: Notifications
xh: Izaziso
zu: Izaziso

source: KYC Approvals
xh: Ukwamkelwa kwe-KYC
zu: Ukuvunywa kwe-KYC

source: Virtual Rewards
xh: Iimbasa Zedijithali
zu: Imiklomelo Yedijithali

source: Logout
xh: Phuma
zu: Phuma
