Repository: Dzunisani007/KasiKashApp
Catalog: translations/tn/LC_MESSAGES/messages.po
Languages: tn

source: admin_settings
tn: Dikgetho tsa Molaodi

source: switch_to_user_view
tn: Fetola go Ponelo ya Mosebelisi

source: admin_settings_subtitle
tn: Bea dikgetho tsa sisteme le tumello

source: user_permissions
tn: Tumello ya Basebelisi

source: financial_controls
tn: Taolo ya Tshelete

source: notifications
tn: Ditsebiso

source: meetings_events
tn: Dikopano & Ditiragalo

source: data_security
tn: Tshireletso ya Data

source: languages
tn: Maleme

source: select_admin_language
tn: Kgetha Leleme la Molaodi

source: english
tn: Senyesemane

source: role_management
tn: Taolo ya Sebopeho

source: assign_roles_help
tn: Nea dibopeho tsa taolo ya tumello

source: admin_full_access
tn: Molaodi - Kena ka Motheo

source: loan_approval_permissions
tn: Tumello ya Tumello ya Maletso

source: choose_loan_approval_roles
tn: Kgetha dibopeho tseo di kgonang go dumelela maletso

source: adminstreasurerssecretaries
tn: Balaodi, Baphethe Tshelete, Bangwadi

source: audit_logs
tn: Di-Log tsa Tekolo

source: theme
tn: Sehlogo:

source: view_audit_logs_help
tn: Bona mosebetsi wa sisteme le phetoho

source: action
tn: Tiro

source: performed_by
tn: E Dirilwe ke

source: target
tn: Mokgatho

source: amount
tn: Tekanyo

source: date
tn: Letsatsi

source: cancel
tn: Khansela

source: save_settings
tn: Boloka Dikgetho

source: contribution_rules
tn: Melao ya Ditlhabollo

source: set_contribution_rules_help
tn: Bea melao ya ditlhabollo tsa maloko

source: monthly_amount
tn: Tekanyo ya Kgwedi:

source: late_penalty
tn: Kotlo ya Go Bili:

source: grace_period
tn: Nako ya Kgetho:

source: days
tn: Matsatsi

source: loan_settings
tn: Dikgetho tsa Maletso

source: configure_loan_settings_help
tn: Bea dikgetho tsa maletso le melao

source: max_loan_percent
tn: Pesente ya Maletso a Motheo:

source: interest_rate
tn: Tekanyo ya Tshelete:

source: repayment_period
tn: Nako ya Go Busetsa:

source: 6 months
tn: Dikgwedi tse 6

source: withdrawal_approvals
tn: Tumello ya Go Tshosa

source: require_dual_approval_help
tn: Nyaka tumello e mebedi ya go tshosa

source: enable_dual_approval_for_withdrawals
tn: Dumelela Tumello e Mebedi ya Go Tshosa

source: recurring_meetings
tn: Dikopano tsa Go Boela

source: schedule_meetings_help
tn: Bea dikopano tsa mehla

source: meeting_frequency
tn: Go Tswalana ga Dikopano:

source: monthly
tn: Ka kgwedi

source: day_of_week
tn: Letsatsi la Beke:

source: monday
tn: Mosupologo

source: time
tn: Nako:

source: send_automatic_reminders
tn: Roma Ditsebiso tsa Boitsebiso

source: attendance_tracking
tn: Go Landa Go Ba Teng

source: record_attendance_help
tn: Ngwala go ba teng ga maloko dikopanong

source: enable_attendance_tracking
tn: Dumelela Go Landa Go Ba Teng

source: absence_penalty
tn: Kotlo ya Go Se Ba Teng:

source: 5after
tn: 5% Morago

source: missed_meetings
tn: Dikopano tse di Se Teng

source: meeting
tn: Kopano

source: present
tn: Teng

source: absent
tn: Ga a Teng

source: Welcome, Admin 👋
tn: Re a go amogela, Admin 👋

source: Stokvel Admin Dashboard
tn: Dashboard ya Botsamaisi ya Stokvel

source: Total Members
tn: Maloko otlhe

source: from last month
tn: go tswa kgweding e e fetileng

source: Active Loans
tn: Dikadimo tse di tshelang

source: pending approval
tn: emetse tetlelelo

source: Total Contributions
tn: Dineelo tsotlhe

source: KYC Pending
tn: KYC e emetse

source: urgent reviews
tn: ditshekatsheko tse di potlakileng

source: Quick Actions
tn: Ditiro tse di Potlakileng

source: Manage Users
tn: Laola Basebedisi

source: Loan Approvals
tn: Tetlelelo ya Dikadimo

source: Virtual Rewards
tn: Dikgaisano tsa Marangrang

source: Generate Reports
tn: Dira Dipego

source: Financial Chart
tn: Chate ya Ditsholego

source: User Growth Chart
tn: Chate ya Kgolo ya Basebedisi

source: User Management
tn: Botsamaisi jwa Basebedisi

source: View, add, edit, or suspend user accounts with advanced filtering and bulk operations.
tn: Bona, tsenya, fetola kgotsa emisa diakhaonto tsa basebedisi ka go sefa go tseneletseng le ditiro tse dintsi.

source: Bulk Operations
tn: Ditiro tse dintsi

source: Review and approve loan applications with detailed financial analysis and risk assessment.
tn: Lekola le go amogela dikopo tsa dikadimo ka tshekatsheko ya madi e e tseneletseng le kotsi.

source: Review Applications
tn: Lekola Dikopo

source: Approval History
tn: Hisitori ya Tetlelelo

source: Generate comprehensive financial reports with advanced analytics and export capabilities.
tn: Dira dipego tse di feletseng tsa madi ka tshekatsheko e e tseneletseng le bokgoni jwa go romela kwa ntle.

source: Export Data
tn: Romela Data

source: Could not load users or stokvels.
tn: Ga e kgone go laisa basebedisi kgotsa stokvels.

source: manage_users
tn: laola_basebedisi

source: Here you can manage all users.
tn: Fano o ka laola basebedisi botlhe.

source: search username or email
tn: batla leina la modirisi kgotsa imeile

source: search
tn: batla

source: add_user
tn: tsenya_modirisi

source: email
tn: imeile

source: role
tn: maikarabelo

source: created_at
tn: tlhamilwe_ka

source: actions
tn: ditiro

source: No users found.
tn: Ga go na basebedisi ba ba fitlhetsweng.

source: Here you can approve or reject loan applications.
tn: Fano o ka amogela kgotsa gana dikopo tsa dikadimo.

source: Filter by status:
tn: Sefa ka seemo:

source: Pending
tn: E emetse

source: Username
tn: Leina la Modirisi

source: Amount
tn: Madi

source: Status
tn: Seemo

source: Transaction Date
tn: Letsatsi la Phetoho

source: Comment
tn: Tshwantsho

source: Actions
tn: Ditshwantsho

source: No loans found for this status.
tn: Ga go na dikadimo tse di fitlhetsweng mo seemong seno.

source: Filter
tn: Hlase

source: Events
tn: Ditiro

source: Here you can manage events.
tn: Mona o ka laola ditiro.

source: Select a Stokvel
tn: Kgetha Stokvel

source: Name
tn: Leina

source: Target Date
tn: Letsatsi la Morero

source: Description
tn: Tlhaloso

source: Send notification to all members of this stokvel
tn: Romela tsebiso go maloko ka moka a stokvel ye

source: Create Event
tn: Hlama Tiro

source: No events found.
tn: Ga go na ditiro tse di hweditsego.

source: Membership Plans
tn: Maano a Botshwaro

source: Here you can manage membership plans.
tn: Mona o ka laola maano a botshwaro.

source: Search by plan name
tn: Nyaka ka leina la morero

source: Add Plan
tn: Oketsa Morero

source: Monthly Contribution
tn: Tshepediso ya Kgwedi

source: Target Amount
tn: Tekanyo ya Morero

source: Total Pool
tn: Mokgatlho wa Motho

source: No membership plans found.
tn: Ga go na maano a botshwaro a a hweditsego.

source: send_notification
tn: romela_tebiso

source: Notification Type
tn: Mofuta wa Tebiso

source: Send to Stokvel Members
tn: Romela go Maloko a Stokvel

source: urgent
tn: ka pela

source: message
tn: molaetša

source: Enter your notification message...
tn: Tsenya molaetša wa gago wa tebiso...

source: type
tn: mofuta

source: Admin Notification
tn: Tebiso ya Taolo

source: Send
tn: Romela

source: Admin Notifications
tn: Ditsebiso tsa Taolo

source: Here you can send notifications to users.
tn: Mona o ka romela ditsebiso go basebedisi.

source: Create Notification
tn: Hlama Tebiso

source: User ID
tn: ID ya Mosebedisi

source: No notifications found.
tn: Ga go na ditsebiso tse di hweditsego.

source: kyc_approvals
tn: dumela_kyc

source: Here you can approve or reject KYC submissions.
tn: Mona o ka dumela kgotsa gana ditlhaeletso tsa KYC.

source: id_document
tn: tokomane_ya_identity

source: proof_of_address
tn: ponahalo_ya_adrese

source: ID Document Status
tn: Maemo a Tokomane ya Identity

source: Proof of Address Status
tn: Maemo a Ponahalo ya Adrese

source: view
tn: bona

source: approve
tn: dumela

source: reject
tn: gana

source: Virtual Rewards Management
tn: Taolo ya Dikgetho tsa Virtual

source: Manage reward points, view user balances, and distribute rewards to users.
tn: Laola dikgetho tsa dikgetho, bona dipalo tsa basebedisi, le abela dikgetho go basebedisi.

source: Overview
tn: Kakaretso

source: Analytics
tn: Dinyakisiso

source: Rules
tn: Melao

source: Users with Reward Cards
tn: Basebedisi ba Dikarata tsa Dikgetho

source: Total Reward Balance
tn: Kakaretso ya Dipalo tsa Dikgetho

source: Total Transactions
tn: Kakaretso ya Dikgwebo

source: Individual Reward Distribution
tn: Kabo ya Dikgetho ya Mongwe le Mongwe

source: User Email
tn: Imeile ya Mosebedisi

source: Reward Type
tn: Mofuta wa Dikgetho

source: Points
tn: Dikgetho

source: Reward description
tn: Tlhaloso ya dikgetho

source: Distribute Reward
tn: Aba Dikgetho

source: Bulk Reward Distribution
tn: Kabo ya Dikgetho ka Kgolo

source: User Filter
tn: Sehlasehi sa Mosebedisi

source: All Users
tn: Basebedisi Ka moka

source: Amount per User
tn: Tekanyo ka Mosebedisi

source: Bulk reward description
tn: Tlhaloso ya dikgetho ka kgolo

source: Bulk Distribute
tn: Aba ka Kgolo

source: Export Transactions (CSV)
tn: Tswelletsa Dikgwebo (CSV)

source: Export Transactions (Excel)
tn: Tswelletsa Dikgwebo (Excel)

source: Export Balances (CSV)
tn: Tswelletsa Dipalo (CSV)

source: Export Balances (Excel)
tn: Tswelletsa Dipalo (Excel)

source: User Reward Balances
tn: Dipalo tsa Dikgetho tsa Basebedisi

source: User
tn: Mosebedisi

source: Card Number
tn: Nomoro ya Karete

source: Balance
tn: Palo

source: Recent Reward Transactions
tn: Dikgwebo tsa Dikgetho tsa Muva

source: Date
tn: Letsatsi

source: Type
tn: Mofuta

source: Reward Analytics
tn: Dinyakisiso tsa Dikgetho

source: Comprehensive analytics and insights for your reward system.
tn: Dinyakisiso tse kgolo le kutlwisiso bakeng sa sisteme ya gago ya dikgetho.

source: Months of Data
tn: Dikgwedi tsa Data

source: Top Earners Tracked
tn: Ba Fumang Kgalo ba Latelwa

source: Reward Types
tn: Mefuta ya Dikgetho

source: Monthly Reward Distribution
tn: Kabo ya Dikgetho ya Kgwedi

source: Top Reward Earners
tn: Ba Fumang Dikgetho Kgalo

source: Rank
tn: Boemo

source: Total Earned
tn: Kakaretso ya Fumang

source: Reward Type Distribution
tn: Kabo ya Mofuta wa Dikgetho

source: Reward Rules Configuration
tn: Peakanyo ya Melao ya Dikgetho

source: Configure automatic reward triggers and multipliers for your reward system.
tn: Peaka dikgetho tsa go tswela ka boyona le dikgetho bakeng sa sisteme ya gago ya dikgetho.

source: Automatic Reward Rules
tn: Melao ya Dikgetho ya go Tswela ka Boyona

source: Contribution Multiplier
tn: Kgetho ya Tshepediso

source: How many reward points users earn per R1 contributed to stokvels.
tn: Dikgetho tse kae tsa dikgetho tseo basebedisi ba di fumang ka R1 e nngwe le e nngwe eo ba e tshepedisang go ma-stokvel.

source: Welcome Bonus
tn: Kgetho ya Kamogelo

source: Reward points given to new users when they join the platform.
tn: Dikgetho tsa dikgetho tseo di abelwang basebedisi ba mpsha fa ba kena platformeng.

source: Referral Bonus
tn: Kgetho ya Kgokagano

source: Reward points given when a user successfully refers another user.
tn: Dikgetho tsa dikgetho tseo di abelwang fa mosebedisi a kgokaganya mosebedisi yo mong ka katlego.

source: Monthly Bonus
tn: Kgetho ya Kgwedi

source: Monthly reward points given to active users who made contributions.
tn: Dikgetho tsa dikgetho tsa kgwedi tseo di abelwang basebedisi ba somago bao ba dirileng tshepediso.

source: Event Attendance Bonus
tn: Kgetho ya Tseno ya Ditiro

source: Reward points given for attending stokvel events and meetings.
tn: Dikgetho tsa dikgetho tseo di abelwang ka go tsenela ditiro tsa ma-stokvel le dikopano.

source: Loan Payment Bonus
tn: Kgetho ya Tefo ya Madi

source: Reward points given for on-time loan payments.
tn: Dikgetho tsa dikgetho tseo di abelwang ka tefo ya madi ka nako.

source: Save Reward Rules
tn: Boloka Melao ya Dikgetho

source: How Reward Rules Work
tn: Melao ya Dikgetho e Somaga jang

source: Contribution Multiplier: Users earn this many points per R1 contributed. Set to 1 for 1:1 ratio.
tn: Kgetho ya Tshepediso: Basebedisi ba fumana dikgetho tse ka tse ka R1 e nngwe le e nngwe eo ba e tshepedisang. Beakanya go 1 bakeng sa tekanyo ya 1:1.

source: Welcome Bonus: Automatically given to new users upon registration.
tn: Kgetho ya Kamogelo: E abelwa ka boyona basebedisi ba mpsha fa ba ngodisa.

source: Referral Bonus: Given when a user successfully refers another user to the platform.
tn: Kgetho ya Kgokagano: E abelwa fa mosebedisi a kgokaganya mosebedisi yo mong platformeng ka katlego.

source: Monthly Bonus: Given monthly to users who made contributions in the previous month.
tn: Kgetho ya Kgwedi: E abelwa kgwedi ka kgwedi go basebedisi bao ba dirileng tshepediso kgweding e fetileng.

source: Event Attendance: Given for attending stokvel events and meetings.
tn: Tseno ya Ditiro: E abelwa ka go tsenela ditiro tsa ma-stokvel le dikopano.

source: Loan Payment: Given for on-time loan payments and good financial behavior.
tn: Tefo ya Madi: E abelwa ka tefo ya madi ka nako le boitshwaro jo botse jwa tsa tshelete.

source: data_export
tn: Romela Data

source: download_data_help
tn: Laolla data ya gago jaaka faele ya CSV

source: two_factor_auth
tn: Netefatso ya Dintlha tse Pedi (2FA)

source: enable_2fa_help
tn: Dumela netefatso ya dintlha tse pedi go sireletsa akhaonto ya gago

source: require_2fa_for_admins
tn: Batla 2FA go balaodi

source: data_retention
tn: Polokelo ya Data

source: configure_data_retention_help
tn: Bea nako ya go boloka histori ya ditransekšene

source: keep_transaction_history_for:
tn: Boloka histori ya ditransekšene bakeng sa:
