Repository: Dzunisani007/KasiKashApp
Catalog: translations/ts/LC_MESSAGES/messages.po
Languages: ts

source: Add New Payment Method
ts: Engetela Ndlela Leyintshwa Yo Hlawula

source: Payment Type
ts: Mufambisi wa Mbofho

source: Dashboard
ts: Xiphephana xa Taolo

source: Manage Users
ts: Lawula Vaxumi

source: Loan Approvals
ts: Ku Amukeriwa ka Mikweleti

source: Events
ts: Swikombiso

source: Membership Plans
ts: Matsongo ya Vuxaka

source: Notifications
ts: Switiviso

source: KYC Approvals
ts: Ku Amukeriwa ka KYC

source: Virtual Rewards
ts: Mivuyelo ya Marang-rang

source: Logout
ts: Huma
